system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Documentation can be found here:
// 2D: https://openfoamwiki.net/index.php/Two_Dimensional_Rising_Bubble_Benchmark_%28two_cases%29
// 3D: http://wissrech.ins.uni-bonn.de/research/projects/risingbubblebenchmark/

application     interIsoFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         1.0;

deltaT          5.8e-5;

writeControl    adjustableRunTime;

writeInterval   0.25;

purgeWrite      0;

writeFormat     binary;

writePrecision  12;

writeCompression off;

timeFormat      general;

timePrecision   8;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           0.05;
maxAlphaCo      0.05;

maxDeltaT       5.8e-5;
maxCapillaryNum 0.5;

libs
(
   "$FOAM_USER_LIBBIN/libdynamicLoadBalanceFvMesh.so"
);

// ************************************************************************* //

// functionObjects
functions
{
    // **************************************************** //
    // **** coded functionObject for bubble processing **** //
    // **************************************************** //
    bubblepproc
    {
        // Load the library containing the 'coded' functionObject
        libs ("libutilityFunctionObjects.so");
        type coded;
        writeControl   timeStep;
        writeInterval  1;
        // Name of on-the-fly generated functionObject
        name bubblepproc;
        // List of include search directories
        codeOptions
        #{
            -I$(LIB_SRC)/sampling/lnInclude \
            -I$(LIB_SRC)/dynamicMesh/lnInclude \
            -I$(LIB_SRC)/surfMesh/lnInclude
        #};
        // List of libraries to link with
        codeLibs
        #{
            -lsampling \
            -ldynamicMesh \
            -lsurfMesh
        #};
        // List of include files
        codeInclude
        #{
            #include "sampledIsoSurface.H"
            #include "vtkSurfaceWriter.H"
        #};
        // Code
        codeWrite
        #{
            Info << "----------bubblepproc----------" << endl;

            // Lookup velocity field U
            const volVectorField& U = mesh().lookupObject<volVectorField>("U");

            // Lookup liquid fraction alpha_liquid
            const volScalarField& alphaLiquid = mesh().lookupObject<volScalarField>("alpha.water");

            // Compute weight (= gaz fraction)
            volScalarField weight
            (
                IOobject
                (
                    "weight",
                    mesh().time().timeName(),
                    U.mesh(),
                    IOobject::NO_READ,
                    IOobject::NO_WRITE
                ),
                (1-alphaLiquid)
            );

            // Compute isosurface alpha=0.5
            dictionary isoSurfDict;
            isoSurfDict.add("type","isoSurface");
            isoSurfDict.add("isoField","alpha.water");
            isoSurfDict.add("isoValue",0.5);
            isoSurfDict.add("regularise","diagcell");
            sampledIsoSurface isoInterface("isoInterface", mesh(), isoSurfDict);
            isoInterface.update();

            // Debug output of isosurface in vtk format
            if ( mesh().time().writeTime() && false )
            {
              // Create output file name and directory
              const fileName outputPath(mesh().time().globalPath()/functionObject::outputPrefix/"bubblepproc_DEBUG"/mesh().time().timeName());
              mkDir(outputPath);
              const fileName outputName(outputPath/isoInterface.name());
              Info << "Writing debug surface: " << outputName << nl;
              // Write file in vtk format
              bool parallel = Pstream::parRun();
              dictionary vtkWriterOptions;
              vtkWriterOptions.add("format","ascii");
              surfaceWriters::vtkWriter writerDebug(isoInterface,outputName,parallel,vtkWriterOptions);
              writerDebug.write();
            }

            // Compute bubble volume
            dimensionedScalar bubbleVolume = fvc::domainIntegrate(weight); // This is integral of "weight" over the volume
            Info << "bubble volume     = " << bubbleVolume.value() << endl;

            // Compute bubble area
            dimensionedScalar bubbleArea = isoInterface.area();
            Info << "bubble area       = " << bubbleArea.value() << endl;

            // Compute bubble center
            dimensionedVector Cb = fvc::domainIntegrate(weight*mesh().C())/bubbleVolume;
            Info << "bubble centroid   = " << Cb.value() << endl;

            // Compute rising velocity
            dimensionedVector Ub = fvc::domainIntegrate(weight*U)/bubbleVolume;
            Info << "bubble velocity   = " << Ub.value() << endl;

            // Compute radius of volume equivalent sphere (from bubble volume)
            dimensionedScalar radiusA = pow(3.0/4.0/constant::mathematical::pi*bubbleVolume, 1.0/3.0);
            Info << "bubble diameter A = " << radiusA.value()*2.0 << endl;

            // Compute radius of bubble (from bubble surface)
            dimensionedScalar radiusB = sqrt(bubbleArea/constant::mathematical::pi/4.0);
            Info << "bubble diameter B = " << radiusB.value()*2.0 << endl;

            // Compute degree of sphericity
            if ( radiusB.value() != 0.0 )
            Info << "bubble sphericity = " << pow(radiusA.value()/radiusB.value(),2) << endl;

            Info << "----------bubblepproc----------\n" << endl;

        #};
    }

    // **************************************************************** //
    // **** sample functionObject for extracting alpha isosurfaces **** //
    // **************************************************************** //
    isoalpha
    {
        type            surfaces;
        libs ("libsampling.so");
        writeControl    adjustableRunTime;
        writeInterval   0.005;

        surfaceFormat   vtk;
        fields          ( U );

        // interpolationScheme. choice of
        //      cell          : use cell-centre value only; constant over cells (default)
        //      cellPoint     : use cell-centre and vertex values
        //      cellPointFace : use cell-centre, vertex and face values.
        //      pointMVC      : use point values only (Mean Value Coordinates)
        //      cellPatchConstrained : like 'cell' but uses cell-centre except on
        //                             boundary faces where it uses the boundary value.
        //      cellPointWallModified: like 'cell' but uses cell-centre except on
        //                             walls faces where it uses the wall value.
        interpolationScheme cellPointFace;

        // Surface sampling definition
        //
        // 1] patches are not triangulated by default
        // 2] planes are always triangulated
        // 3] iso-surfaces are always triangulated
        surfaces
        (
          interfaceGL
          {
              // Iso surface for constant values.
              // Triangles guaranteed not to cross cells.
              type            isoSurface;
              isoField        alpha.water;
              isoValue        0.5;
              interpolate     false;
              regularise      true;
          }
        );
    }

    // *********************************************** //
    // **** functionObject for Lambda2 computing  **** //
    // *********************************************** //
    computeLambda2
    {
        type            Lambda2;
        libs            ("libfieldFunctionObjects.so");
        executeControl  adjustableRunTime;
        executeInterval 0.005;
        writeControl    none;
    }

    // ****************************************************************** //
    // **** sample functionObject for extracting Lambda2 isosurfaces **** //
    // ****************************************************************** //
    isolambda2
    {
        type            surfaces;
        libs ("libsampling.so");
        writeControl    adjustableRunTime;
        writeInterval   0.005;

        surfaceFormat   vtk;
        fields          ( Lambda2 );

        // interpolationScheme. choice of
        //      cell          : use cell-centre value only; constant over cells (default)
        //      cellPoint     : use cell-centre and vertex values
        //      cellPointFace : use cell-centre, vertex and face values.
        //      pointMVC      : use point values only (Mean Value Coordinates)
        //      cellPatchConstrained : like 'cell' but uses cell-centre except on
        //                             boundary faces where it uses the boundary value.
        //      cellPointWallModified: like 'cell' but uses cell-centre except on
        //                             walls faces where it uses the wall value.
        interpolationScheme cellPointFace;

        // Surface sampling definition
        //
        // 1] patches are not triangulated by default
        // 2] planes are always triangulated
        // 3] iso-surfaces are always triangulated
        surfaces
        (
          iso2em4
          {
              // Iso surface for constant values.
              // Triangles guaranteed not to cross cells.
              type            isoSurface;
              isoField        Lambda2;
              isoValue        100;
              interpolate     false;
              regularise      true;
          }
        );
    }

    minMaxLambda2
    {
        type            fieldMinMax;
        libs            ("libfieldFunctionObjects.so");

        writeControl    adjustableRunTime;
        writeInterval   0.005;

        write           false;
        log             true;
        mode            magnitude;
        fields          ( Lambda2 );
    }

    // ****************************************************** //
    // **** color images done with runTimePostProcessing **** //
    // ****************************************************** //
    #include "visualization"

    // **************************************************************** //
    // **** sample functionObject for extracting alpha isosurfaces **** //
    // **************************************************************** //
    freeSurface
    {
        type            surfaces;
        libs ("libsampling.so");
        writeControl    adjustableRunTime;
        writeInterval   0.005;

        surfaceFormat   raw;
        fields          ( alpha.water );

        // interpolationScheme. choice of
        //      cell          : use cell-centre value only; constant over cells (default)
        //      cellPoint     : use cell-centre and vertex values
        //      cellPointFace : use cell-centre, vertex and face values.
        //      pointMVC      : use point values only (Mean Value Coordinates)
        //      cellPatchConstrained : like 'cell' but uses cell-centre except on
        //                             boundary faces where it uses the boundary value.
        //      cellPointWallModified: like 'cell' but uses cell-centre except on
        //                             walls faces where it uses the wall value.
        interpolationScheme cellPointFace;

        // Surface sampling definition
        //
        // 1] patches are not triangulated by default
        // 2] planes are always triangulated
        // 3] iso-surfaces are always triangulated
        surfaces
        (
          freeSurface
          {
              // Iso surface for constant values.
              // Triangles guaranteed not to cross cells.
              type            isoSurface;
              isoField        alpha.water;
              isoValue        0.5;
              interpolate     true;
              regularise      false;
          }
        );
    }

    vorticity
    {
        // Mandatory entries
        type            vorticity;
        libs            (fieldFunctionObjects);
 
        // Optional (inherited) entries
        field           U;
        result          vorticityField;
        region          region0;
        enabled         true;
        log             true;
        timeStart       0;
        timeEnd         1.0;
        executeControl  timeStep;
        executeInterval 1;
        writeControl    adjustableRunTime;
        writeInterval   0.25;
    }

}

// ************************************************************************* //
