system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale 1;

// Geometrical details
db 5.76e-03;    // [m]; bubble diameter
diL 1;          // [m]; number of bubble diameters in the refined region
dxzL 3;         // [m]; number of bubble diameters in the bulk region
dyL 32;         // [m]; number of bubble diameters in the y-region
di 20;          // [-]; number of cell elements per unit diameter in the refined region
dx 10;           // [-]; number of cell elements per unit diameter in the bulk region

Lip #eval{ $diL * $db };   // m; length of the refined region in the positive direction
Liy #eval{2*$diL * $db };   // m; length of the refined region in the positive direction
Lin #eval{-$diL * $db };   // m; length of the refined region in the negative direction

Lxzp #eval{ ($diL+$dxzL) * $db };  // m; length of the domain in the positive x-direction
Lxzn #eval{-($diL+$dxzL) * $db };  // m; length of the domain in the negative x-direction
Ly   #eval{ $dyL * $db };          // m; length of the domain in the y-direction

vertices
(
    // refined region
    ( $Lin   0    $Lin )    // vertex number 0
    ( $Lip   0    $Lin )    // vertex number 1
    ( $Lip  $Liy  $Lin )    // vertex number 2
    ( $Lin  $Liy  $Lin )    // vertex number 3
    ( $Lin   0    $Lip )    // vertex number 4
    ( $Lip   0    $Lip )    // vertex number 5
    ( $Lip  $Liy  $Lip )    // vertex number 6
    ( $Lin  $Liy  $Lip )    // vertex number 7
	
	// lower bulk region
    ( $Lin   0    $Lxzn )    // vertex number 8
    ( $Lip   0    $Lxzn )    // vertex number 9
    ( $Lip  $Liy  $Lxzn )    // vertex number 10
    ( $Lin  $Liy  $Lxzn )    // vertex number 11
	
    ( $Lin   0    $Lxzp )    // vertex number 12
    ( $Lip   0    $Lxzp )    // vertex number 13
    ( $Lip  $Liy  $Lxzp )    // vertex number 14
    ( $Lin  $Liy  $Lxzp )    // vertex number 15
	
	( $Lxzn  0    $Lin )    // vertex number 16
    ( $Lin   0    $Lin )    // vertex number 17
    ( $Lin  $Liy  $Lin )    // vertex number 18
    ( $Lxzn $Liy  $Lin )    // vertex number 19
	( $Lxzn  0    $Lip )    // vertex number 20
    ( $Lin   0    $Lip )    // vertex number 21
    ( $Lin  $Liy  $Lip )    // vertex number 22
    ( $Lxzn $Liy  $Lip )    // vertex number 23
	
	( $Lxzn  0    $Lxzn )    // vertex number 24
    ( $Lin   0    $Lxzn )    // vertex number 25
    ( $Lin  $Liy  $Lxzn )    // vertex number 26
    ( $Lxzn $Liy  $Lxzn )    // vertex number 27
	
	( $Lxzn  0    $Lxzp )    // vertex number 28
    ( $Lin   0    $Lxzp )    // vertex number 29
    ( $Lin  $Liy  $Lxzp )    // vertex number 30
    ( $Lxzn $Liy  $Lxzp )    // vertex number 31
	
	( $Lip    0    $Lin )    // vertex number 32
    ( $Lxzp   0    $Lin )    // vertex number 33
    ( $Lxzp  $Liy  $Lin )    // vertex number 34
    ( $Lip   $Liy  $Lin )    // vertex number 35
	( $Lip    0    $Lip )    // vertex number 36
    ( $Lxzp   0    $Lip )    // vertex number 37
    ( $Lxzp  $Liy  $Lip )    // vertex number 38
    ( $Lip   $Liy  $Lip )    // vertex number 39
	
	( $Lip    0   $Lxzn )    // vertex number 40
    ( $Lxzp   0   $Lxzn )    // vertex number 41
    ( $Lxzp  $Liy $Lxzn )    // vertex number 42
    ( $Lip   $Liy $Lxzn )    // vertex number 43
	
	( $Lip    0   $Lxzp )    // vertex number 44
    ( $Lxzp   0   $Lxzp )    // vertex number 45
    ( $Lxzp  $Liy $Lxzp )    // vertex number 46
    ( $Lip   $Liy $Lxzp )    // vertex number 47
	
	// upper bulk region
    ( $Lxzn  $Liy $Lxzn )    // vertex number 48
    ( $Lxzp  $Liy $Lxzn )    // vertex number 49
    ( $Lxzp  $Ly  $Lxzn )    // vertex number 50
    ( $Lxzn  $Ly  $Lxzn )    // vertex number 51
    ( $Lxzn  $Liy $Lxzp )    // vertex number 52
    ( $Lxzp  $Liy $Lxzp )    // vertex number 53
    ( $Lxzp  $Ly  $Lxzp )    // vertex number 54
    ( $Lxzn  $Ly  $Lxzp )    // vertex number 55

);

// number of cells and expnsion ratio for one block with multigrading
nxz #eval{ 2*($dxzL) * $dx + 2*($di)};            // [-]; number of cells in the x and z directions
nyt  #eval{ ($dyL-2*$diL) * $dx + 2*($di) };      // [-]; number of cells in the y-direction
dxz_wall #eval{ $dxzL/(2*($diL+$dxzL)) };         // [%]; percentage of the x and z direction in the region near the wall 
dy_wall  #eval{ ($dyL-2*$diL)/($dyL) };           // [%]; percentage of the y direction in the region near the wall
dxz_core #eval{ 1/($diL+$dxzL) };                 // [%]; percentage of the x and z direction in the core region
dy_core  #eval{ 2*$diL/($dyL) };                  // [%]; percentage of the y direction in the core region
nxz_wall #eval{ $dxzL * $dx/$nxz };               // [%]; percentage of cells in the region near the wall in the x and z directions
ny_wall  #eval{ ($dyL-2*$diL)*($dx)/$nyt };       // [%]; percentage of cells in the region near the wall in the y direction
nxz_core #eval{ (2*$di)/$nxz };                   // [%]; percentage of cells in the core region in the x and z directions
ny_core  #eval{ (2*$di)/$nyt };                   // [%]; percentage of cells in the core region in the y direction

// number of cells in the refined region
nip   #eval{2*$diL * $di };  // [-]; number of cells

// number of cells in the lower bulk region
nixz #eval{ 2*$diL * $dx };   // [-]; number of cells in the x and z directions
nbxz #eval{ $dxzL * $dx };   // [-]; number of cells in the x and z directions
niy  #eval{2*$diL * $dx };   // [-]; number of cells in the y-direction

// number of cells in the upper bulk region
nxzu #eval{ 2*($diL+$dxzL) * $dx };     // [-]; number of cells in the x and z directions
nyu  #eval{ ($dyL-2*$diL) * $dx };   // [-]; number of cells in the y-direction

// number of cells and expnsion ratio for one block without multigrading
nxzs  #eval{ 2*($diL + $dxzL)* $dx};            // [-]; number of cells in the x and z directions
nyts  #eval{ ($dyL) * $dx };   // [-]; number of cells in the y-direction

blocks
(
    // one block with multigrading
    //hex (24 41 50 51 28 45 54 55) ($nxz $nyt $nxz)  //simpleGrading (1 1 1)
	// two blocks with multigrading
	//hex (24 41 42 48 28 45 46 52) ($nxz $nip $nxz)  //simpleGrading (1 1 1)
	/* simpleGrading
    (
        (
            ($dxz_wall $nxz_wall 1)    // % x-dir, % cells in x, expansion ratio
			($dxz_core $nxz_core 1)    // % x-dir, % cells in x, expansion ratio
            ($dxz_wall $nxz_wall 1)    // % x-dir, % cells in x, expansion ratio
        )
        (
            //($dy_core $ny_core 1)      // % y-dir, % cells in y, expansion ratio
            //($dy_wall $ny_wall 1)      // % y-dir, % cells in y, expansion ratio
			//1
        )
        (
            ($dxz_wall $nxz_wall 1)    // % z-dir, % cells in z, expansion ratio
			($dxz_core $nxz_core 1)    // % z-dir, % cells in z, expansion ratio
            ($dxz_wall $nxz_wall 1)    // % z-dir, % cells in z, expansion ratio
        )

    ) */
	
    // refined region
    //hex (0 1 2 3 4 5 6 7) ($nip $nip $nip)  simpleGrading (1 1 1)
	
	// lower bulk region
	/* hex (8 9 10 11 0 1 2 3) ($nip $nip $nbxz)  simpleGrading (1 1 1)
    hex (4 5 6 7 12 13 14 15) ($nip $nip $nbxz)  simpleGrading (1 1 1)
	hex (16 17 18 19 20 21 22 23) ($nbxz $nip $nip)  simpleGrading (1 1 1)
	hex (24 25 26 27 16 17 18 19) ($nbxz $nip $nbxz)  simpleGrading (1 1 1)
	hex (20 21 22 23 28 29 30 31) ($nbxz $nip $nbxz)  simpleGrading (1 1 1)
	hex (32 33 34 35 36 37 38 39) ($nbxz $nip $nip)  simpleGrading (1 1 1)
	hex (40 41 42 43 32 33 34 35) ($nbxz $nip $nbxz)  simpleGrading (1 1 1)
	hex (36 37 38 39 44 45 46 47) ($nbxz $nip $nbxz)  simpleGrading (1 1 1) */
	
	// upper bulk region
	//hex (48 49 50 51 52 53 54 55) ($nxzu $nyu $nxzu)  simpleGrading (1 1 1)

    // one block without multigrading
    hex (24 41 50 51 28 45 54 55) ($nxzs $nyts $nxzs)  simpleGrading (1 1 1)


);

edges
(
);

boundary
(
    front_wall
    {
        type wall;
        faces
        (
            //(0 3 2 1)
			/* (8 11 10 9)
			(24 27 26 25)
			(40 43 42 41)
			(48 51 50 49)	*/
            (24 51 50 41)	
			/* (24 48 42 41)
			(48 51 50 49) */			
        );
    }
	
    back_wall
    {
        type wall;
        faces
        (
            //(4 5 6 7)
            /* (12 13 14 15)
			(28 29 30 31)
			(44 45 46 47)
			(52 53 54 55) */
			(28 45 54 55)
			/* (28 45 46 52)
			(52 53 54 55) */
        );
    }
	
    left_wall
    {
        type wall;
        faces
        (
            /* (0 4 7 3)
			(16 20 23 19)
			(16 27 24 19)
			(20 31 28 23)
			(48 52 55 51) */
			(24 28 55 51)
			/* (24 28 52 48)
			(48 52 55 51) */
        );
    }
	
    right_wall
    {
        type wall;
        faces
        (
            //(2 6 5 1)
		    /* (34 38 37 33)
			(34 42 41 33)
			(38 46 45 37)
			(50 54 53 49) */
			(50 54 45 41)
			/* (42 46 45 41)
			(50 54 53 49) */
        );
    }
	
    bottom_wall
    {
        type wall;
        faces
        (
            /* (1 5 4 0)
			(1 9 8 0)
			(5 13 12 4)
			(17 21 20 16)
			(17 25 24 16)
			(21 29 28 20)
			(33 37 36 32)
			(33 41 40 32)
			(37 45 44 36) */
			(41 45 28 24)
        );
    }
	
    top_wall
    {
        type patch;
        faces
        (
            //(3 7 6 2)
			(51 55 54 50)
        );
    }
	
	/* top_lower_region
    {
        type patch;
        faces
        ( */
            /* (3 7 6 2)
	        (3 11 10 2)
	        (7 15 14 6)
	        (19 23 22 18)
	        (19 27 26 18)
	        (23 31 30 22)
	        (35 39 38 34)
	        (35 43 42 34)
	        (39 47 46 38) */
			/* (46 52 48 42)
        );
    } */
	
	 /* bottom_upper_region
    {
        type patch;
        faces
        (
	        (49 53 52 48)
        );
    } */

);

mergePatchPairs
(

    //(bottom_upper_region top_lower_region)
);

// ************************************************************************* //
