constant/dynamicMeshDict
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dynamicFvMesh       dynamicMultiDimRefineBalancedFvMesh;
// dynamicFvMesh      dynamicRefineFvMesh;
// dynamicFvMesh      staticFvMesh;

adaptCriteria
{
    // type fieldBounds;
    // fieldName alpha.water;
    // lowerBound 0.01;
    // upperBound 0.99;

    type composedAdaptCriteria;
    operation or;
    criteria
    (
        interface
        {
            type fieldBounds;
            fieldName alpha.water;
            lowerBound 0.01;
            upperBound 0.99;
            nLayer     2;
        }
        fluid
        {
            type fieldBounds;
            fieldName alpha.water;
            lowerBound 0.01;
            upperBound 0.99;
            maxCellLevel 1;
        }
    );
}

multiCritRefinementControls
{
    enableMultiCritRefinementControl  true;
    
    fields // must be scalarFields
    (
        //alpha (min max refineLevel)
        // refine cells where alpha in [0.01:0.99] with maximal 2 refinement layers
        alpha.water
        {
            minValue  0.01;
            maxValue  0.99;
            refineLevel 1;
            nAddLayers  1; // add two cell layers at the refinement border
        }
    );
    
    interface // must be a scalarField (only one dictionary!)
    (
        alpha.water // refine interface (found based on snGrad of alpha > 0.1) 
        {
            innerRefLayers 2; // describes how many cell layers inside phase alpha are to be refined
            outerRefLayers 5; // describes how many cell layers outside phase alpha are to be refined
            
            // optional settings:
            maxRefineLevel 1; // max refinement layers; Default: maxRefinement from dynamicRefineFvMeshCoeffs is used
            // to get slower than 2:1 refinement; add #nAddLayers between each refinement level at the interface
            nAddLayers 1; //Default: 0 
        }
    );
    
    gradients // must be scalars
    (
        // arguments as in 'fields'
        // min/max values are based on mag(fvc::grad(volScalarField)) * cellVolume
        alpha.water    (1e-7 1.75e-6 1)
    );
    
    curls // must be vectors
    (
        // arguments as in 'fields'
        // min/max values are based on mag(fvc::curl(volVectorField))
        U   (5e+1 5e+3 1)
    );
    
    regions
    (
        /* boxToCell
        {
            minLevel 1;         
            box (-1 0.001 0.002)(1 0.005 0.003);
        } */
		
        /* cylinderToCell
        {
            p1 (0 0 0);
            p2 (0 14.624e-2 0);
            radius 9.14e-3;
        } */

        /* sphereToCell
        {
            minLevel    1;
            source      sphereToCell;
            origin      (0 5.76e-3 0);
            radius      2.88e-3;
        }  */     
    );
}

// Refinement
dynamicMultiDimRefineBalancedFvMeshCoeffs
{
    // Extra entries for balancing
    enableBalancing true;
    allowableImbalance 0.7;

    field multiCritRefinementField;    // volScalarField to base refinement on, or
                    // multiCritRefinementField; 
                    // to use multiple criteria specified in 
                    // multiCritRefinementControls

    // Which cells to un/refine: based on point values (simple averaging).
    // - refine pointCells of point value inbetween minLevel..maxLevel
    // - unrefine pointCells that are within nBufferLayers of points marked
    //   for refinement.
    minLevel 0.01;
    maxLevel 0.99;

    // Refine field inbetween lower..upper
    lowerRefineLevel 0.5; // do not change
    upperRefineLevel 1.5; // maxRefinement+0.5
    unrefineLevel   10;  // If value < unrefineLevel unrefine

    // Newly introduced patch points optionally get projected onto a surface
    //projectSurfaces ("fixedWalls4.stl");
    //projectPatches (fixedWalls);
    // Maximum project distance
    //projectDistance 1;
}

    // Refine every refineInterval timesteps
    refineInterval 1;

    // Maximum refinement level (starts from 0)
    maxRefinement 1;
	
    // Have slower than 2:1 refinement
    nBufferLayers 2;

    // Maximum cell limit (approximate)
    maxCells 10000000;

	// Fluxes to adapt. For newly created faces or split faces the flux
    // gets estimated from an interpolated volVectorField ('velocity')
    // First is name of the flux to adapt, second is velocity that will
    // be interpolated and inner-producted with the face area vector.
    correctFluxes
    (
        (phi none)
        (nHatf none)
        (rhoPhi none)
        (alphaPhi0.water none)
        (alphaPhiUn none)
        (alphaPhi_ none)
        (ghf none)
        (phi none)
        (dVf_ none)
    );
	
	// List of non-flux surface<Type>Fields to be mapped
    // only for new internal faces (AMR refine)
    mapSurfaceFields
    (
    );

    // Write the refinement level as a volScalarField
    dumpLevel       true;

// ************************************************************************* //