0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    front_wall
    {
        type            noSlip;
    }

    back_wall
    {
        type            noSlip;
    }

    left_wall
    {
        type            noSlip;
    }

    right_wall
    {
        type            noSlip;
    }

    bottom_wall
    {
        type            noSlip;
    }

    top_wall
    {
        type            noSlip;
    }
}


// ************************************************************************* //
