0.orig/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1.01325e+5;

boundaryField
{
    front_wall
    {
        type            fixedFluxPressure;
        value           $internalField;
    }

    back_wall
    {
        type            fixedFluxPressure;
        value           $internalField;
    }

    left_wall
    {
        type            fixedFluxPressure;
        value           $internalField;
    }

    right_wall
    {
        type            fixedFluxPressure;
        value           $internalField;
    }

    bottom_wall
    {
        type            fixedFluxPressure;
        value           $internalField;
    }

    top_wall
    {
        type            fixedFluxPressure;
        value           $internalField;
    }
}

// ************************************************************************* //
