system/visualization
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

// Creation of images with runTimePostProcessing

// Timing
_visualization
{
        writeControl    adjustableRunTime;
        writeInterval   0.001;
}

#include "runTimePostProcessing"

#remove _visualization

// ************************************************************************* //
